package СontrolFlowStatements.Loops;

public class DoWhileLoop {
    /*
    У Java існує цикл `do-while`, який виконує певний блок коду принаймні один раз,
     а потім продовжує його виконувати, поки задана умова є істинною.

    1. Блок коду всередині оператора `do` виконується.
    2. Потім перевіряється умова.
    3. Якщо умова є `true`, блок коду виконується знову. Це продовжується, поки умова не стане `false`.
    4. Якщо умова спочатку є `false`, блок коду все одно виконується один раз.
    */
    public static void main(String[] args) {
        int i = 0;
        do {
            System.out.println("Лічильник: " + i);
            i++;
        } while (i <= 5);
    }
}
