package СontrolFlowStatements.Loops;

import java.util.ArrayList;
import java.util.List;

public class ForLoop {
/*
У Java цикл `for` є одним з
найпоширеніших циклів і використовується для повторення певного блоку коду
задану кількість разів. Він має більш гнучку структуру, що дозволяє контролювати
початкову умову, умову продовження і зміну після кожної ітерації.

Синтаксис циклу `for` виглядає наступним чином:

for (ініціалізація; умова; зміна) {
    // Код, що виконується
}
Ось пояснення кожної частини циклу `for`:
- `ініціалізація`: Ініціалізація змінної циклу перед початком ітерацій.
Це може бути присвоєння початкового значення змінній, яка використовується у циклі.
- `умова`: Умова, яка перевіряється перед кожною ітерацією.
Якщо умова є істинною, цикл продовжується; якщо вона є хибною, цикл завершується.
- `зміна`: Зміна, яка відбувається після кожної ітерації. Це може бути зміна значення
змінної або інший крок, який має відбутися після кожної ітерації.

У цьому прикладі змінна `i` ініціалізується значенням 1,
умова перевіряє, що `i` не перевищує 5, і після кожної
ітерації значення `i` збільшується на 1.
*/
    public static void main(String[] args) {
        //простий цикл
        for (int i = 1; i <= 5; i++) {
            System.out.println(i);
        }
        //вкладений цикл
        for (int i = 1; i <= 3; i++) {
            System.out.println("Зовнішній цикл: " + i);

            for (int j = 1; j <= 2; j++) {
                System.out.println("  Внутрішній цикл: " + j);
            }
        }
        //Collections
        //ArrayList
        List<String> names = new ArrayList<>();
        names.add("Анна");
        names.add("Богдан");
        names.add("Вікторія");
        names.add("Дмитро");

        for (int i = 0; i < names.size(); i++) {
            String name = names.get(i);
            System.out.println("Ім'я: " + name);
        }


    }
}
