package СontrolFlowStatements;

public class BreakStatement {
    public static void main(String[] args) {
/*
Оператор break в Java використовується для припинення виконання циклу або виходу
з блоку коду умовно. Коли оператор break виконується, виконання найближчого зовнішнього
циклу або блоку коду негайно припиняється, і керування передається наступному оператору після циклу або блоку коду.

Оператор break може бути корисним, коли потрібно перервати виконання циклу або вийти з блоку коду,
враховуючи певну умову. Наприклад, якщо ви шукаєте певний елемент у масиві, і як тільки ви його знаходите,
ви можете використати break, щоб вийти з циклу, оскільки далі перевіряти немає потреби.
*/
        for (int i = 0; i < 10; i++) {
            if (i == 5) {
                break;
            }
            System.out.println(i);
        }


    }
}
